{
  "model_type": "yolo",
  "task": "object-detection",
  "architectures": [
    "YOLO11n"
  ],
  "input_size": [
    416,
    416
  ],
  "num_classes": 12,
  "class_names": [
    "white_pawn",
    "white_knight",
    "white_bishop",
    "white_rook",
    "white_queen",
    "white_king",
    "black_pawn",
    "black_knight",
    "black_bishop",
    "black_rook",
    "black_queen",
    "black_king"
  ],
  "license": "apache-2.0",
  "tags": [
    "chess",
    "object-detection",
    "yolo",
    "pieces"
  ]
}